In [1]:
import pandas as pd

In [2]:
"""
    Pandas é uma biblioteca para manipular dados de forma
    estruturadas.
"""

'\n    Pandas é uma biblioteca para manipular dados de forma\n    estruturadas.\n'

In [3]:
# O pandas tem a facilidade a manipulação de dados.
# A sua performace é inferior a do Numpy

In [4]:
# data frame: são estrutura cimilares a tabela, como se fosse banco de dados
tabela = pd.DataFrame({ 
    'nome': [
        'Rafael',
        'Joao',
        'Felipe',
        'Maria'
        ],
    'nota': [
        10,
        9,
        8,
        7
    ] 
})

In [5]:
tabela

     nome  nota
0  Rafael    10
1    Joao     9
2  Felipe     8
3   Maria     7

In [6]:
tabela.nome

0    Rafael
1      Joao
2    Felipe
3     Maria
Name: nome, dtype: object

In [7]:
tabela.nome[2]

'Felipe'

In [8]:
# número da linha depois o nome da coluna
tabela.loc[2, 'nome']

'Felipe'

In [9]:
# Criar uma média baseado em nome
tabela.groupby('nome').mean()

        nota
nome
Felipe   8.0
Joao     9.0
Maria    7.0
Rafael  10.0

In [10]:
# Filtro: bscar nota de felipe
tabela.nota[tabela.nome == 'Felipe']

2    8
Name: nota, dtype: int64